---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurface
source: html/512ed949-c635-dd5e-8905-11ba75a85965.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurface Property

Can't construct surface.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeSurface { get; }
```